Feature: Аутентификация на https://restful-booker.herokuapp.com/auth

  Scenario: Аутентификация с валидными логином и паролем
    Given Используем валидные логин и пароль
    When Отправляем запрос на аутентификацию
    Then Статус-код ответа должен быть 200
    And Ответ должен содержать токен

  Scenario: Аутентификация с НЕвалидными логином и паролем
    Given Используем НЕвалидные логин и пароль
    When Отправляем запрос на аутентификацию
    Then Статус-код ответа должен быть 200
    And Ответ должен содержать сообщение об ошибке
